app/Models/ItemModel.php

SELECT *
FROM `item`
WHERE `item`.`id` = '13'
---
    function itemInfo($id)
    {
        return $this->find($id);

SELECT *
FROM `item`
WHERE `kategori` = 1
SELECT *
FROM `item`
WHERE `kategori` = 2
---
    public function getItems()
    {
        $result = [
            'HSR' => $this->db->table($this->table)->getWhere(['kategori' => 1])->getResultArray(),
            'GI' => $this->db->table($this->table)->getWhere(['kategori' => 2])->getResultArray(),
        ];